In [1]:
import sqlite3
import pandas as pd
from typing import Union, Dict, List

def SQLite3(db_name: str, sql_code: str = "", mode: str = "") -> Union[pd.DataFrame, str, Dict[str, List[str]]]:
    """
    Execute SQL queries or list tables and columns in a SQLite database.
    For SELECT queries, the results are displayed in a tabular format like pandas DataFrame.

    :param db_name: Name of the SQLite database file.
    :param sql_code: SQL query or command to execute. Default is an empty string.
    :param mode: Operation mode (e.g., 'list_tables_and_columns'). Default is an empty string.
    :return: Depending on the operation:
             - DataFrame with query results for read operations,
             - Confirmation message for write operations,
             - Dictionary of tables and columns if listing tables and columns.
    """
    # Connect to the SQLite database
    conn = sqlite3.connect(db_name)

    # Function to list all tables and their columns
    def list_tables_and_columns() -> Dict[str, List[str]]:
        tables_and_columns = {}
        try:
            cursor = conn.execute("SELECT name FROM sqlite_master WHERE type='table';")
            tables = cursor.fetchall()
            for table in tables:
                table_name = table[0]
                cursor = conn.execute(f"PRAGMA table_info({table_name});")
                columns = cursor.fetchall()
                column_names = [column[1] for column in columns]
                tables_and_columns[table_name] = column_names
        except sqlite3.Error as e:
            print(f"An error occurred: {e}")
        return tables_and_columns

    try:
        if mode == "list_tables_and_columns":
            return list_tables_and_columns()
        else:
            if sql_code.strip().upper().startswith("SELECT"):
                df = pd.read_sql_query(sql_code, conn)
                return df
            else:
                conn.execute(sql_code)
                conn.commit()
                return "Query executed successfully."
    except sqlite3.Error as e:
        return f"An error occurred: {e}"
    finally:
        conn.close()

/var/folders/7d/7c4hrscx0vg406v60dbtjg9h0000gn/T/ipykernel_20242/499981955.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
# Assuming SQLite3 function is defined as above

# Database name
db_name = "marketing.db"

# Create tables and insert data for demonstration
# Note: These SQL commands are for setup purposes. Ensure the database is set up before running join examples.
setup_commands = [
    """
    CREATE TABLE IF NOT EXISTS customers (
        customer_id INTEGER PRIMARY KEY,
        customer_name TEXT NOT NULL,
        email TEXT NOT NULL
    );
    """,
    """
    CREATE TABLE IF NOT EXISTS orders (
        order_id INTEGER PRIMARY KEY,
        customer_id INTEGER,
        order_date TEXT NOT NULL,
        amount DECIMAL(10, 2) NOT NULL,
        FOREIGN KEY (customer_id) REFERENCES customers(customer_id)
    );
    """,
    "INSERT OR IGNORE INTO customers (customer_id, customer_name, email) VALUES (1, 'John Doe', 'john.doe@example.com');",
    "INSERT OR IGNORE INTO customers (customer_id, customer_name, email) VALUES (2, 'Jane Smith', 'jane.smith@example.com');",
    "INSERT OR IGNORE INTO customers (customer_id, customer_name, email) VALUES (3, 'Kenechukwu Ezekwem', 'kce232@nyu.edu');",
    "INSERT OR IGNORE INTO customers (customer_id, customer_name, email) VALUES (4, 'Alice Johnson', 'alice.johnson@example.com');",
    "INSERT OR IGNORE INTO customers (customer_id, customer_name, email) VALUES (5, 'Bob White', 'bob.white@example.com');",
    "INSERT OR IGNORE INTO customers (customer_id, customer_name, email) VALUES (6, 'Charlie Brown', 'charlie.brown@example.com');",
    "INSERT OR IGNORE INTO customers (customer_id, customer_name, email) VALUES (7, 'Diana Prince', 'diana.prince@example.com');",
    "INSERT OR IGNORE INTO customers (customer_id, customer_name, email) VALUES (8, 'Ethan Hunt', 'ethan.hunt@example.com');",
    "INSERT OR IGNORE INTO customers (customer_id, customer_name, email) VALUES (9, 'Fiona Gallagher', 'fiona.gallagher@example.com');",
    "INSERT OR IGNORE INTO orders (order_id, customer_id, order_date, amount) VALUES (1, 1, '2024-02-01', 99.99);",
    "INSERT OR IGNORE INTO orders (order_id, customer_id, order_date, amount) VALUES (2, 1, '2024-02-01', 99.99);",
    "INSERT OR IGNORE INTO orders (order_id, customer_id, order_date, amount) VALUES (3, 1, '2024-02-03', 20.00);",
    "INSERT OR IGNORE INTO orders (order_id, customer_id, order_date, amount) VALUES (4, 2, '2024-02-02', 20.00);",
    "INSERT OR IGNORE INTO orders (order_id, customer_id, order_date, amount) VALUES (5, 3, '2024-02-02', 100.00);",
    "INSERT OR IGNORE INTO orders (order_id, customer_id, order_date, amount) VALUES (6, 3, '2024-02-03', 150.00);",
    "INSERT OR IGNORE INTO orders (order_id, customer_id, order_date, amount) VALUES (7, 4, '2024-02-04', 200.00);",
    "INSERT OR IGNORE INTO orders (order_id, customer_id, order_date, amount) VALUES (8, 5, '2024-02-05', 450.00);",
    "INSERT OR IGNORE INTO orders (order_id, customer_id, order_date, amount) VALUES (9, 6, '2024-02-06', 150.00);",
    "INSERT OR IGNORE INTO orders (order_id, customer_id, order_date, amount) VALUES (10, 4, '2024-02-07', 330.00);",
    "INSERT OR IGNORE INTO orders (order_id, customer_id, order_date, amount) VALUES (11, 5, '2024-02-08', 150.00);",
    "INSERT OR IGNORE INTO orders (order_id, customer_id, order_date, amount) VALUES (12, 6, '2024-02-09', 350.00);",
    "INSERT OR IGNORE INTO orders (order_id, customer_id, order_date, amount) VALUES (13, 7, '2024-02-10', 400.00);",
    "INSERT OR IGNORE INTO orders (order_id, customer_id, order_date, amount) VALUES (14, 8, '2024-02-11', 450.00);",
    "INSERT OR IGNORE INTO orders (order_id, customer_id, order_date, amount) VALUES (15, 9, '2024-02-12', 17.00);",
    "INSERT OR IGNORE INTO orders (order_id, customer_id, order_date, amount) VALUES (16, 7, '2024-02-13', 180.00);",
    "INSERT OR IGNORE INTO orders (order_id, customer_id, order_date, amount) VALUES (17, 8, '2024-02-14', 600.00);",
    "INSERT OR IGNORE INTO orders (order_id, customer_id, order_date, amount) VALUES (18, 9, '2024-02-15', 378.00)"
]

# Execute setup commands
for cmd in setup_commands:
    print(SQLite3(db_name, sql_code=cmd))

# INNER JOIN Example
inner_join_sql = """
SELECT customers.customer_name, orders.order_date, orders.amount
FROM customers
INNER JOIN orders ON customers.customer_id = orders.customer_id;
"""
print("INNER JOIN Results:")
print(SQLite3(db_name, inner_join_sql))

# LEFT JOIN Example
left_join_sql = """
SELECT customers.customer_name, orders.order_date, orders.amount
FROM customers
LEFT JOIN orders ON customers.customer_id = orders.customer_id;
"""
print("\nLEFT JOIN Results:")
print(SQLite3(db_name, left_join_sql))

# RIGHT JOIN is not directly supported in SQLite, but you can achieve similar results by reversing the join.

# CROSS JOIN Example
cross_join_sql = """
SELECT customers.customer_name, orders.order_date, orders.amount
FROM customers
CROSS JOIN orders;
"""
print("\nCROSS JOIN Results (limited output for brevity):")
print(SQLite3(db_name, cross_join_sql)[:5])  # Limiting output for brevity

Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
Query executed successfully.
INNER JOIN Results:
         customer_name  order_date  amount
0             John Doe  2024-02-01   99.99
1             John Doe  2024-02-01   99.99
2             John Doe  2024-02-03   20.00
3           Jane Smith  2024-02-02   20.00
4   Kenechukwu Ezekwem  2024-02-02  100.00
5   Kenechukwu Ezekwem  2024-02-03  150.00
6        Alice Johnson  2024-02-04  200.00
7            Bob White  2024-02-05  450.00
8        Charlie Brown  2024-02-06  150.00
9        Alice Johnson  2024-02-07  330.00
10           Bob White  2024-02-08  150.00
11       Charlie Brown  2024-02-09  350.00
12        Diana Prince  2024-02-10  400.00
13          Ethan Hunt  2024-02-11  450.00
14     Fiona Gallagher  2024-02-12   17.00
15        Diana Prince  2024-02-13  180.00
16          Ethan Hunt  2024-02-14  600.00
17     Fiona Gallagher  2024-02-15  378.00

LEFT JOIN Results:
         customer_name  order_date  amount
0             John Doe  2024-02-01   99.99
1             John Doe  2024-02-01   99.99
2             John Doe  2024-02-03   20.00
3           Jane Smith  2024-02-02   20.00
4   Kenechukwu Ezekwem  2024-02-02  100.00
5   Kenechukwu Ezekwem  2024-02-03  150.00
6        Alice Johnson  2024-02-04  200.00
7        Alice Johnson  2024-02-07  330.00
8            Bob White  2024-02-05  450.00
9            Bob White  2024-02-08  150.00
10       Charlie Brown  2024-02-06  150.00
11       Charlie Brown  2024-02-09  350.00
12        Diana Prince  2024-02-10  400.00
13        Diana Prince  2024-02-13  180.00
14          Ethan Hunt  2024-02-11  450.00
15          Ethan Hunt  2024-02-14  600.00
16     Fiona Gallagher  2024-02-12   17.00
17     Fiona Gallagher  2024-02-15  378.00

CROSS JOIN Results (limited output for brevity):
  customer_name  order_date  amount
0      John Doe  2024-02-01   99.99
1      John Doe  2024-02-01   99.99
2      John Doe  2024-02-03   20.00
3      John Doe  2024-02-02   20.00
4      John Doe  2024-02-02  100.00

Certainly! Here's how you might present these SQL query exercises to your students in a Jupyter Notebook, including questions for them to answer based on the explanations provided. This format encourages critical thinking about how different types of `JOIN` operations and conditions can be used to retrieve specific data sets from a relational database.

---

## SQL Query Exercises

In this exercise, you will explore different SQL queries using `JOIN` operations and conditional selections to retrieve data from a relational database. The database consists of two tables: `customers` and `orders`. Your goal is to construct queries that meet specific criteria outlined below and explain how each query works.

### Database Schema

- **customers:** customer_id (INTEGER), customer_name (TEXT), email (TEXT)
- **orders:** order_id (INTEGER), customer_id (INTEGER, referencing customers), order_date (TEXT), amount (DECIMAL)

### Exercises

#### Exercise 1: INNER JOIN with Date Range

Construct a SQL query to select the customer name, order date, and order amount for orders placed between February 1, 2024, and February 7, 2024. Use an `INNER JOIN` to match each order with its corresponding customer.

```sql
-- Your SQL query below:
```

**Question 1:** Explain how the `INNER JOIN` operation works in this query and why it is used instead of other types of joins.

In [3]:
print(SQLite3(db_name,
              """
SELECT customers.customer_name, orders.order_date, orders.amount
FROM customers
INNER JOIN orders ON customers.customer_id = orders.customer_id
WHERE orders.order_date BETWEEN '2024-02-01' AND '2024-02-07';

              """))

        customer_name  order_date  amount
0            John Doe  2024-02-01   99.99
1            John Doe  2024-02-01   99.99
2            John Doe  2024-02-03   20.00
3          Jane Smith  2024-02-02   20.00
4  Kenechukwu Ezekwem  2024-02-02  100.00
5  Kenechukwu Ezekwem  2024-02-03  150.00
6       Alice Johnson  2024-02-04  200.00
7           Bob White  2024-02-05  450.00
8       Charlie Brown  2024-02-06  150.00
9       Alice Johnson  2024-02-07  330.00

#### Exercise 2: LEFT JOIN with Amount Range

Write a SQL query to find all customers and any orders they might have placed within a specific amount range (50 to 200). Include all customers, even if they haven't placed an order within this range, using a `LEFT JOIN`.

```sql
-- Your SQL query below:
```

**Question 2:** Describe how the `LEFT JOIN` operation is utilized in this query to include all customers regardless of whether they have orders within the specified amount range. How does the use of `IFNULL` function enhance the readability of the query's results?

In [4]:
print(SQLite3(db_name,
              """
SELECT customers.customer_name, IFNULL(orders.order_date, 'No Order') AS order_date, IFNULL(orders.amount, 0) AS amount
FROM customers
LEFT JOIN orders ON customers.customer_id = orders.customer_id AND orders.amount BETWEEN 50 AND 200;

              """))

         customer_name  order_date  amount
0             John Doe  2024-02-01   99.99
1             John Doe  2024-02-01   99.99
2           Jane Smith    No Order    0.00
3   Kenechukwu Ezekwem  2024-02-02  100.00
4   Kenechukwu Ezekwem  2024-02-03  150.00
5        Alice Johnson  2024-02-04  200.00
6            Bob White  2024-02-08  150.00
7        Charlie Brown  2024-02-06  150.00
8         Diana Prince  2024-02-13  180.00
9           Ethan Hunt    No Order    0.00
10     Fiona Gallagher    No Order    0.00

#### Exercise 3: Date and Amount Range with INNER JOIN

Create a SQL query that selects orders based on both date (February 1, 2024, to February 15, 2024) and amount (greater than 100) ranges. Employ an `INNER JOIN` to correlate the orders with customer details.

```sql
-- Your SQL query below:
```

**Question 3:** Explain the rationale behind combining both date and amount conditions in this query. How does this approach help in retrieving a more specific subset of data?

In [5]:
print(SQLite3(db_name,
              """
SELECT customers.customer_name, orders.order_date, orders.amount
FROM customers
INNER JOIN orders ON customers.customer_id = orders.customer_id
WHERE orders.order_date BETWEEN '2024-02-01' AND '2024-02-15'
AND orders.amount > 100;

              """))

         customer_name  order_date  amount
0   Kenechukwu Ezekwem  2024-02-03     150
1        Alice Johnson  2024-02-04     200
2            Bob White  2024-02-05     450
3        Charlie Brown  2024-02-06     150
4        Alice Johnson  2024-02-07     330
5            Bob White  2024-02-08     150
6        Charlie Brown  2024-02-09     350
7         Diana Prince  2024-02-10     400
8           Ethan Hunt  2024-02-11     450
9         Diana Prince  2024-02-13     180
10          Ethan Hunt  2024-02-14     600
11     Fiona Gallagher  2024-02-15     378

In [6]:
print(SQLite3(db_name,
              """
SELECT customers.customer_name, SUM(orders.amount) AS total_spent
FROM customers
JOIN orders ON customers.customer_id = orders.customer_id
GROUP BY customers.customer_name
ORDER BY total_spent DESC;

              """))

        customer_name  total_spent
0          Ethan Hunt      1050.00
1           Bob White       600.00
2        Diana Prince       580.00
3       Alice Johnson       530.00
4       Charlie Brown       500.00
5     Fiona Gallagher       395.00
6  Kenechukwu Ezekwem       250.00
7            John Doe       219.98
8          Jane Smith        20.00

Here's of the SQL code:

```sql
SELECT customers.customer_name, SUM(orders.amount) AS total_spent
FROM customers
JOIN orders ON customers.customer_id = orders.customer_id
GROUP BY customers.customer_name
ORDER BY total_spent DESC;
```

### Breakdown of the Query:

- **SELECT**: This part selects two columns: the `customer_name` from the `customers` table and the sum of `amount` from the `orders` table, labeling it as `total_spent`.
- **FROM**: Specifies the `customers` table as the starting point for the join.
- **JOIN**: Performs an inner join between the `customers` and `orders` tables based on the `customer_id` field. This ensures that only customers who have made orders are included.
- **GROUP BY**: Aggregates the results by `customer_name`, so that the `SUM` function calculates the total amount spent for each customer.
- **ORDER BY**: Sorts the results by `total_spent` in descending order, so that the customer who has spent the most appears first. If you want to list them in ascending order (from the least to the most spent), you could replace `DESC` with `ASC`.

This query provides a clear view of customer spending, ranked from highest to lowest, which can be particularly useful for understanding customer value or for targeted marketing campaigns.

In [7]:
print(SQLite3(db_name,
              """
SELECT order_date, SUM(amount) AS total_spent
FROM orders
GROUP BY order_date
ORDER BY total_spent DESC
LIMIT 1;

              """))

   order_date  total_spent
0  2024-02-14          600

An error occurred: near "DATABASE": syntax error